In [28]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [ ]:
#Series
##A Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) 
##and an associated array of data labels, called its index

In [5]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj.values

array([ 4,  7, -5,  3])

In [13]:
obj2=Series([4,7,-5,3],index=['a','b','c','d'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [20]:
obj2[2]

-5

In [21]:
obj2['c']

-5

In [25]:
obj2[['d','a','b']]

d    3
a    4
b    7
dtype: int64

In [26]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [27]:
obj2*2

a     8
b    14
c   -10
d     6
dtype: int64

In [29]:
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [30]:
'b' in obj2

True

In [32]:
#pass a dictionary data to a series data
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3=Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4=Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [38]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [39]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [40]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [41]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [42]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [43]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [45]:
obj4.name = 'population'
obj4.index.name= 'states'
obj4

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [46]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [47]:
#DataFrame

In [53]:
data={'state':['ohio','ohio','ohio','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}
data

{'state': ['ohio', 'ohio', 'ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [54]:
frame=DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [55]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [57]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [60]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [62]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [63]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [67]:
frame2.ix['three']

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [68]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [70]:
frame2['debt'] = np.arange(5)
frame2

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [71]:
val=Series([-1.2,-1.5,-1.7],index=['two','three','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6  -1.5
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9  -1.7

In [73]:
frame2['eastern']=(frame2.state=='ohio')
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2     True
three  2002    ohio  3.6  -1.5     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9  -1.7    False

In [78]:
del frame2['eastern']

KeyError: 'eastern'

In [80]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [82]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [83]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [87]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [88]:
DataFrame(pop,index=[2000,2001,2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [90]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [93]:
frame3.index.name='year'
frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [97]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [98]:
frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, -1.5],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [ ]:
#Index Objects

In [100]:
obj = Series(range(3), index=['a', 'b', 'c'])
index=obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [102]:
index[1:]

Index(['b', 'c'], dtype='object')

In [104]:
#Index objects are immutable and thus can’t be modified by the user:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [106]:
index=pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [108]:
obj2=Series([1.6,-2.5,0],index)
obj2

0    1.6
1   -2.5
2    0.0
dtype: float64

In [109]:
obj2.index is index

True

In [110]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [111]:
'Ohio' in frame3.columns

True

In [113]:
2004 in frame3.index

False

In [114]:
#Essential Functionality

In [115]:
##Reindexing
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [119]:
obj2=obj.reindex(['c','a','b','d','e'])
obj2

c    3.6
a   -5.3
b    7.2
d    4.5
e    NaN
dtype: float64

In [121]:
obj2=obj.reindex(['c','a','b','d','e'],fill_value=0)
obj2

c    3.6
a   -5.3
b    7.2
d    4.5
e    0.0
dtype: float64

In [122]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')
obj3

0      blue
2    purple
4    yellow
dtype: object

In [136]:
frame=DataFrame(np.arange(9).reshape(3,3),index=['a','b','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
d     6      7           8

In [137]:
frame2=frame.reindex(['a','b','c','d','e'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   NaN    NaN         NaN
d   6.0    7.0         8.0
e   NaN    NaN         NaN

In [146]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
d      7   NaN           8

In [147]:
frame.reindex(index=['a','b','c','d'], method='ffill', columns=states)

ValueError: index must be monotonic increasing or decreasing

In [148]:
frame.ix[['a', 'b', 'c', 'd'], states]

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

KeyError: "['c'] not in index"

In [ ]:
#Dropping entries from an axis

In [149]:
obj=Series(np.arange(5),index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [150]:
new_obj=obj.drop('c')

In [151]:
new_obj

a    0
b    1
d    3
e    4
dtype: int64

In [152]:
obj.drop(['c','d'])

a    0
b    1
e    4
dtype: int64

In [154]:
#Indexing, selection, and filtering

In [156]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [157]:
obj['b']

1.0

In [159]:
obj[2]

2.0

In [160]:
obj[['b','c']]

b    1.0
c    2.0
dtype: float64

In [161]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [164]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [165]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [167]:
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data['three']

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

In [170]:
data[['one','three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [171]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [173]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [174]:
data<3

            one    two  three   four
Ohio       True   True   True  False
Colorado  False  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [175]:
data[data<3]=0
data

          one  two  three  four
Ohio        0    0      0     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [176]:
data.ix['Colorado',['one','three']]

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:961: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  return getattr(section, self.name)[new_key]

one      4
three    6
Name: Colorado, dtype: int64

In [177]:
data.ix[['Colorado','Utah'],['one','three']]

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  three
Colorado    4      6
Utah        8     10

In [178]:
data.ix[2]

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [179]:
data.ix[:'Utah', 'two']

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [180]:
data.ix[data.three > 5, :3]

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [181]:
#Arithmetic and data alignment

In [182]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [183]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [184]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [185]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [187]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [188]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [189]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [190]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [191]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [192]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [193]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [194]:
arr[0]

array([0., 1., 2., 3.])

In [195]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [196]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [197]:
series = frame.ix[0]
series

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [198]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [200]:
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [201]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [205]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [203]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [204]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [ ]:
#Function application and mapping

In [207]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.156474 -0.703679 -0.228428
Ohio   -0.737682  0.514886  0.603270
Texas  -1.144500 -0.338399  0.791067
Oregon  0.616615  1.098427 -0.172432

In [208]:
np.abs(frame)

               b         d         e
Utah    0.156474  0.703679  0.228428
Ohio    0.737682  0.514886  0.603270
Texas   1.144500  0.338399  0.791067
Oregon  0.616615  1.098427  0.172432

In [209]:
f = lambda x: x.max() - x.min()

In [210]:
frame.apply(f)

b    1.761116
d    1.802106
e    1.019496
dtype: float64

In [211]:
frame.apply(f, axis=1)

Utah      0.860154
Ohio      1.340953
Texas     1.935568
Oregon    1.270859
dtype: float64

In [213]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [214]:
frame.apply(f)

            b         d         e
min -1.144500 -0.703679 -0.228428
max  0.616615  1.098427  0.791067

In [215]:
frame.apply(f,axis=1)

             min       max
Utah   -0.703679  0.156474
Ohio   -0.737682  0.603270
Texas  -1.144500  0.791067
Oregon -0.172432  1.098427

In [216]:
format=lambda x: '%.2f' %x

In [217]:
frame.applymap(format)

            b      d      e
Utah     0.16  -0.70  -0.23
Ohio    -0.74   0.51   0.60
Texas   -1.14  -0.34   0.79
Oregon   0.62   1.10  -0.17

In [219]:
frame['e'].map(format)

Utah      -0.23
Ohio       0.60
Texas      0.79
Oregon    -0.17
Name: e, dtype: object

In [220]:
#Sorting and ranking

In [221]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [224]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [226]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [227]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [228]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [229]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [230]:
obj = Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [233]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [235]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [236]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [240]:
frame=DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [241]:
frame.sort_index(by='b')

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [242]:
frame.sort_index(by=['a','b'])

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [246]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [247]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [248]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [250]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [251]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [252]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [ ]:
#Axis indexes with duplicate values

In [253]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [254]:
obj.index.is_unique

False

In [255]:
obj['a']

a    0
a    1
dtype: int64

In [256]:
obj['b']

b    2
b    3
dtype: int64

In [257]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.059298 -2.468548 -0.245900
a -0.041851  0.303774 -1.473482
b -0.342840  1.645345  0.861502
b -2.111620  0.456515 -0.438135

In [258]:
df.ix['b']

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

         0         1         2
b -0.34284  1.645345  0.861502
b -2.11162  0.456515 -0.438135

In [259]:
#Summarizing and Computing Descriptive Statistics

In [260]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [261]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [262]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [263]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [264]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [265]:
df.idxmax()

one    b
two    d
dtype: object

In [266]:
df.idxmin()

one    d
two    b
dtype: object

In [267]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [268]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [269]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [270]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [277]:
#Unique Values, Value Counts, and Membership

In [280]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [281]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [282]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [283]:
pd.value_counts(obj.values, sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [284]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [285]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [286]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [287]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [288]:
pd.value_counts?

In [ ]:
#Handling Missing Data

In [289]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [290]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [291]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [292]:
#Filtering Out Missing Data

In [294]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [296]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [298]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [300]:
cleaned=data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [301]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [302]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [303]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [304]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

          0         1         2
0  0.352744       NaN       NaN
1 -0.366863       NaN       NaN
2 -0.634044       NaN       NaN
3 -0.427288       NaN  0.270754
4  0.658473       NaN  0.426296
5 -0.268272  0.955395 -0.132150
6  0.077396  0.886236  1.724602

In [307]:
# Suppose you want to keep only rows containing a certain number of observations. 
#You can indicate this with the thresh argument
df.dropna(thresh=3)

          0         1         2
5 -0.268272  0.955395 -0.132150
6  0.077396  0.886236  1.724602

In [308]:
df.dropna(thresh=2)

          0         1         2
3 -0.427288       NaN  0.270754
4  0.658473       NaN  0.426296
5 -0.268272  0.955395 -0.132150
6  0.077396  0.886236  1.724602

In [309]:
#Filling in Missing Data

In [310]:
df.fillna(0)

          0         1         2
0  0.352744  0.000000  0.000000
1 -0.366863  0.000000  0.000000
2 -0.634044  0.000000  0.000000
3 -0.427288  0.000000  0.270754
4  0.658473  0.000000  0.426296
5 -0.268272  0.955395 -0.132150
6  0.077396  0.886236  1.724602

In [311]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.352744  0.500000       NaN
1 -0.366863  0.500000       NaN
2 -0.634044  0.500000       NaN
3 -0.427288  0.500000  0.270754
4  0.658473  0.500000  0.426296
5 -0.268272  0.955395 -0.132150
6  0.077396  0.886236  1.724602

In [313]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

/Users/jinli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

          0         1         2
0 -1.571636  1.160277 -0.220167
1  0.209091  0.988168 -0.403081
2  0.436399       NaN  1.820946
3 -0.653680       NaN -0.210756
4  1.067560       NaN       NaN
5  0.907196       NaN       NaN

In [314]:
df.fillna(method='ffill')

          0         1         2
0 -1.571636  1.160277 -0.220167
1  0.209091  0.988168 -0.403081
2  0.436399  0.988168  1.820946
3 -0.653680  0.988168 -0.210756
4  1.067560  0.988168 -0.210756
5  0.907196  0.988168 -0.210756

In [315]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.571636  1.160277 -0.220167
1  0.209091  0.988168 -0.403081
2  0.436399  0.988168  1.820946
3 -0.653680  0.988168 -0.210756
4  1.067560       NaN -0.210756
5  0.907196       NaN -0.210756

In [316]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [317]:
#Hierarchical Indexing

In [318]:
data = Series(np.random.randn(10),index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [319]:
data

a  1    0.810525
   2    0.215610
   3    0.387247
b  1    1.362515
   2   -0.554126
   3    1.145688
c  1    0.184668
   2    0.784045
d  2    0.700593
   3   -1.423993
dtype: float64

In [323]:
data=Series(np.random.randn(9),index=[['a','a','a','b','b','b','c','c','c'],[1,2,3]*3])
data

a  1    1.725240
   2    0.144036
   3    1.989382
b  1   -0.020870
   2    0.210022
   3    1.616226
c  1   -1.601959
   2   -1.304293
   3    2.077410
dtype: float64

In [325]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('c', 3)],
           )

In [326]:
data['b']

1   -0.020870
2    0.210022
3    1.616226
dtype: float64

In [330]:
data[:,1]

a    1.725240
b   -0.020870
c   -1.601959
dtype: float64

In [333]:
data.unstack()

          1         2         3
a  1.725240  0.144036  1.989382
b -0.020870  0.210022  1.616226
c -1.601959 -1.304293  2.077410

In [335]:
data.unstack().stack()

a  1    1.725240
   2    0.144036
   3    1.989382
b  1   -0.020870
   2    0.210022
   3    1.616226
c  1   -1.601959
   2   -1.304293
   3    2.077410
dtype: float64

In [338]:
frame = DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [339]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [341]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [342]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [344]:
#Reordering and Sorting Levels

In [345]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [347]:
#Summary Statistics by Level

In [348]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [349]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [350]:
#Using a DataFrame’s Columns

In [351]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
'd': [0, 1, 2, 0, 1, 2, 3]})

In [352]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [354]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [355]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [356]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1